Revit 2024 API
Application.NewCurveArrArray Method
Creates an empty array that can store geometric curve loops.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurveArrArray NewCurveArrArray()
Visual Basic
Public Function NewCurveArrArray As CurveArrArray
Visual C++
public:
CurveArrArray^ NewCurveArrArray()
Return Value
The empty array of curve loops.
See Also
Application Class
Autodesk.Revit.Creation Namespace